tests/TestData/StripeWebhook/po_created.json

{
  "account": "acct_unitTest123",
  "created": 1326853478,
  "livemode": false,
  "id": "evt_00000000000000",
  "type": "payout.created",
  "object": "event",
  "request": null,
  "pending_webhooks": 1,
  "api_version": "2022-08-01",
  "data": {
    "object": {
      "id": "po_externalId_123",
      "object": "payout",
      "amount": 1100,
      "arrival_date": 1598535656,
      "automatic": true,
      "balance_transaction": "txn_00000000000000",
      "created": 1598535656,
      "currency": "gbp",
      "description": "STRIPE PAYOUT",
      "destination": "ba_1HKlLYKkGuKkxwBN6Ptrj9UT",
      "failure_balance_transaction": null,
      "failure_code": null,
      "failure_message": null,
      "livemode": false,
      "metadata": {
      },
      "method": "standard",
      "source_type": "card",
      "statement_descriptor": null,
      "status": "pending",
      "type": "bank_account"
    }
  }
}
